I am not sure why, but for me it is hit and miss... I had to run `terraform apply` three times (without changing anything to the config) for it to work.

```
jasper@arch-pc terraform]$ terraform apply                                                                                                                                                                                                   
data.rancher2_cluster.cluster: Refreshing state...                                                                                                                                                                                            
rancher2_project.jenkins: Refreshing state... [id=c-dj2jn:p-7cb6j]                                                                                                                                                                            
rancher2_catalog.helmStable: Refreshing state... [id=p-7cb6j:helm-stable]                                                                                                                                                                     
rancher2_namespace.jenkins: Refreshing state... [id=jenkins]                                                                                                                                                                                  
                                                                                                                                                                                                                                              
An execution plan has been generated and is shown below.                                                                                                                                                                                      
Resource actions are indicated with the following symbols:                                                                                                                                                                                    
  + create                                                                                                                                                                                                                                    
                                                                                                                                                                                                                                              
Terraform will perform the following actions:                                                                                                                                                                                                 
                                                                                                                                                                                                                                              
  # rancher2_app.jenkins will be created                                                                                                                                                                                                      
  + resource "rancher2_app" "jenkins" {                                                                                                                                                                                                       
      + annotations      = (known after apply)                                                                                                                                                                                                
      + catalog_name     = "p-7cb6j:helm-stable"                                                                                                                                                                                              
      + description      = (known after apply)                                                                                                                                                                                                
      + external_id      = (known after apply)                                                                                                                                                                                                
      + force_upgrade    = false                                                                                                                                                                                                              
      + id               = (known after apply)                                                                                                                                                                                                
      + labels           = (known after apply)                                                                                                                                                                                                
      + name             = "jenkins"                                                                                                                                                                                                          
      + project_id       = "c-dj2jn:p-7cb6j"                                                                                                                                                                                                  
      + revision_id      = (known after apply)                                                                                                                                                                                                
      + target_namespace = "jenkins"                                                                                                                                                                                                          
      + template_name    = "jenkins"                                                                                                                                                                                                          
      + template_version = "1.19.0"         

...

Error: Bad response statusCode [500]. Status [500 Internal Server Error]. Body: [baseType=error, code=ServerError, message=catalogtemplateversions.management.cattle.io "helm-stable-jenkins-1.19.0" not found] from [https://localhost/v3/pro
ject/c-dj2jn:p-7cb6j/apps]                                                                                                                                                                                                                    

  on main.tf line 52, in resource "rancher2_app" "jenkins": 
  52: resource "rancher2_app" "jenkins" {

```